
// ফাংশন একটি প্যারামিটার নেওয়ার সময়, দুইটি পদ্ধতি ব্যবহৃত হয় - Pass by Value এবং Pass by Reference।

// Pass by Value হল ফাংশনে প্যারামিটার হিসাবে একটি কপি নেওয়া এবং কপি সম্পূর্ণভাবে স্বয়ংক্রিয় হিসাবে ফাংশনের ভিতর ব্যবহৃত হয়। এটি মূলত কমপ্যাক্ট হয় এবং স্থিতিশীল প্রক্রিয়ার ক্ষেত্রে নিরাপদ। যদি ফাংশন প্যারামিটারগুলি কোনও পরিবর্তন না করে, তবে কোনও প্রবলেম নেই। তবে, যদি ফাংশন প্যারামিটারগুলির কোনও মান পরিবর্তন করা হয় তবে সেটি কেবল ফাংশনের ভিতরে পরিবর্তন হয়।

//দুটি সংখ্যা যোগ করার জন্য একটি ফাংশন ব্যবহার করব।

#include <stdio.h>

void add(int a, int b) 
{
    a = a + b;
    printf("Inside the function: %d\n", a);
}

int main()
{
    int x = 10, y = 5;
    add(x, y);
    printf("Outside the function: %d\n", x);
    return 0;
}
 
// এখানে আমরা দেখতে পাচ্ছি যে ফাংশনের ভিতরে a এবং b একটি